Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/OmegaT_ESP32-level2.tmx
Source language: en_us
Languages: it_it

source: "text/html" tells the client that the server is sending back HTML content.
it_it: "text/html" indica al client che il server sta restituendo contenuto HTML.

source: *If entering “http://ESP32.local” does not work, try replacing “ESP32” with module’s IP address.
it_it: *Se inserendo “http://ESP32.local” non funziona, provare a sostituire “ESP32” con l'indirizzo IP del modulo.

source: - It is recommended that you avoid using these pins.
it_it: - Si consiglia di evitare l'uso di questi pin.

source: - Pay close attention because their behavior, particularly during boot, can be unpredictable.
it_it: - Prestare molta attenzione perché il loro comportamento, in particolare durante l'avvio, può essere imprevedibile.

source: - Your top priority pins.
it_it: - I pin con priorità più alta.

source: -40 °C to +125 °C
it_it: da -40 °C a +125 °C

source: 1 Mbps for BR2-3 Mbps for EDR
it_it: 1 Mbps per BR2-3 Mbps per EDR

source: 1 × 52-bit system timer
it_it: 1 timer di sistema a 52 bit

source: 1 × TWAI® controller (compatible with ISO 11898-1)
it_it: 1 controller TWAI® (compatibile con ISO 11898-1)

source: 1 × temperature sensor
it_it: 1 sensore di temperatura

source: 10-bit SAR ADC on 1 channel
it_it: ADC SAR a 10-bit su 1 canale

source: 12-bit SAR ADC up to 18 channels
it_it: ADC SAR a 12-bit fino a 18 canali

source: 128-bit UUID: is used for custom (vendor-specific) services and characteristics.
it_it: UUID a 128 bit: viene utilizzato per servizi e caratteristiche personalizzati (specifici del fornitore).

source: 15 available GPIOs (module)
it_it: 15 GPIO disponibili (modulo)

source: 15 channels of 12-bit SAR ADC with selectable ranges of 0-1V, 0-1.4V, 0-2V, or 0-4V
it_it: 15 canali di ADC SAR a 12 bit con intervalli selezionabili di 0-1 V, 0-1,4 V, 0-2 V o 0-4 V

source: 16 channels
it_it: 16 canali

source: 16-bit UUID: is used for official BLE profiles, services, and characteristics.
it_it: UUID a 16 bit: viene utilizzato per profili, servizi e caratteristiche BLE ufficiali.

source: 17 programmable GPIOs
it_it: 17 GPIO programmabili

source: 17 programmable pins
it_it: 17 pin programmabili

source: 2 DAC channels
it_it: 2 canali DAC

source: 2 DAC channels - Two 8-bit DACs to generate true analog voltages
it_it: 2 canali DAC - Due DAC a 8 bit per generare tensioni analogiche reali

source: 2 UART interfaces
it_it: 2 interfacce UART

source: 2 UART interfaces - 2 UART interfaces with flow control and IrDA support
it_it: 2 Interfacce UART: 2 interfacce UART con controllo di flusso e supporto IrDA

source: 2 UART interfaces with flow control and IrDA support
it_it: 2 interfacce UART con controllo di flusso e supporto IrDA

source: 2 × 12-bit SAR ADCs, up to 6 channels
it_it: 2 ADC SAR a 12 bit, fino a 6 canali

source: 2 × 54-bit general-purpose timers
it_it: 2 timer generici a 54 bit

source: 2-16ms (Avg.
it_it: 2-16ms (Media

source: 200 is the HTTP status code, indicating a successful request.
it_it: 200 è il codice di stato HTTP, che indica una richiesta riuscita.

source: 22 × programmable GPIOs
it_it: 22 GPIO programmabili

source: 250mA during RF transmissions
it_it: 250 mA durante le trasmissioni RF

source: 3 × watchdog timers
it_it: 3 timer watchdog

source: 34 programmable GPIOs
it_it: 34 GPIO programmabili

source: 34 programmable pins
it_it: 34 pin programmabili

source: 4 MB flash in chip package
it_it: 4 MB di memoria flash nel package del chip

source: 4 channels
it_it: 4 canali

source: 4 timing modes of the SPI format transfer
it_it: 4 modalità di temporizzazione del trasferimento del formato SPI

source: 4MB external flash
it_it: 4 MB di flash esterna

source: 5 µA during Sleep Mode
it_it: 5 µA in modalità Sleep

source: 5 Mbps communication speed
it_it: Velocità di comunicazione 5 Mbps

source: 5 V power supply
it_it: 5 V alimentazione

source: 520kB internal SRAM
it_it: 520 kB di SRAM interna

source: 8 m up to 100 m
it_it: Da 8 m a 100 m

source: 802.11b/g/n Wi-Fi transceiver
it_it: Ricetrasmettitore Wi-Fi 802.11b/g/n

source: 9 GPIOs with capacitive touch sensing
it_it: 9 GPIO con rilevamento tattile capacitivo

source: 9 Touch Pads
it_it: 9 Touch Pad

source: 9 Touch Pads - 9 GPIOs with capacitive touch sensing.
it_it: 9 Touch Pad - 9 GPIO con rilevamento tattile capacitivo.

source: After installing, launch the “Serial Bluetooth Terminal” app. Click on the icon in the top left corner and choose “Devices”.
it_it: Dopo l'installazione, avviare l'app "Serial Bluetooth Terminal". Cliccare sull'icona nell'angolo in alto a sinistra e selezionare “Devices”.

source: For the next steps in this tutorial, you need a Bluetooth Terminal application installed on your smartphone. We recommend using the Android app “Serial Bluetooth Terminal,” available in the Play Store.
it_it: Per i passaggi successivi di questo tutorial, è necessario che l'applicazione "Bluetooth Terminal" sia installata sullo smartphone. Consigliamo di utilizzare l'app Android "Serial Bluetooth Terminal", disponibile sul Play Store.

source: Make sure the ESP32 is powered up and ready to establish a connection.
it_it: Assicurarsi che l'ESP32 sia acceso e pronto a stabilire una connessione.

source: Now, swipe down from the top of your Android phone’s screen and make sure Bluetooth is turned on.
it_it: Ora, si scorre verso il basso dalla parte superiore dello schermo del telefono Android e ci si assicura che il Bluetooth sia attivo.

source: Now, type something in the input box located at the bottom of the app , for example, “Hi!”
it_it: Ora, digitare qualcosa nella casella di input situata nella parte inferiore dell'app , ad esempio, “Hi!”

source: Tap the name of the Bluetooth device you want to pair with your device (in our case, ESP32test).
it_it: Toccare il nome del dispositivo Bluetooth che si desidera associare al dispositivo (nel nostro caso, ESP32test).

source: Touch and hold the Bluetooth icon , then tap “Pair new device” and wait a few seconds.
it_it: Toccare e tenere premuta l'icona Bluetooth , quindi toccare "Pair new device" e attendere qualche secondo.

source: You can also exchange data between your Serial Monitor and your smartphone. Type something in the Serial Monitor’s top input box and press the “Send” button.
it_it: Si possono anche scambiare dati tra il Monitor Seriale e lo smartphone. Digitare qualcosa nella casella di input superiore del Monitor Seriale e premere il pulsante “Send”.

source: You should get a “Connected” message. That’s it!
it_it: Si dovrebbe ricevere il messaggio “Connected”. Fatto!

source: You should instantly receive that message in the Arduino IDE Serial Monitor.
it_it: Si dovrebbe ricevere immediatamente il messaggio nel Monitor Seriale dell'IDE Arduino.

source: You should instantly receive that message in the Serial Bluetooth Terminal App.
it_it: Si dovrebbe ricevere immediatamente il messaggio nell'app Serial Bluetooth Terminal.

source: You should see a list of devices you’ve previously paired with. Select “ESP32test” from this list.
it_it: Si dovrebbe visualizzare un elenco dei dispositivi con cui si è effettuata l'associazione in precedenza. Selezionare "ESP32test" da questo elenco.

source: A 128-bit UUID looks like this: 4fafc201-1fb5-459e-8fcc-c5c9c331914b.
it_it: Un UUID a 128 bit si presenta così: 4fafc201-1fb5-459e-8fcc-c5c9c331914b.

source: A GATT characteristic is a group of information called Attributes.
it_it: Una caratteristica GATT è un gruppo di informazioni chiamate Attributi.

source: A GATT service is a collection of conceptually related data called characteristics.
it_it: Un servizio GATT è una raccolta di dati concettualmente correlati, denominati caratteristiche.

source: A Hall effect sensor capable of detecting magnetic fields.
it_it: Un sensore a effetto Hall in grado di rilevare campi magnetici.

source: A Temperature sensor meant to measure the internal temperature of the chip and not the ambient temperature, which can be useful for monitoring the microcontroller’s health.
it_it: Un sensore di temperatura progettato per misurare la temperatura interna del chip e non la temperatura ambiente, utile per monitorare lo stato del microcontrollore.

source: A capacitive touch sensor which can be used for touch-sensitive input.
it_it: Un sensore touch capacitivo utilizzabile per input sensibili al tocco.

source: A few years ago, the ESP8266 revolutionized the embedded IoT world.
it_it: Qualche anno fa, l'ESP8266 ha rivoluzionato il mondo dell'IoT embedded.

source: A guide explaining the process can be found here <guides/core_debug>
it_it: Una guida che spiega il processo è disponibile qui <guides/core_debug>

source: A peripheral can be either a GATT client or a GATT server or both, and similarly, a central can be either a GATT client or a GATT server.
it_it: Una periferica può essere un client GATT o un server GATT, oppure entrambi, e allo stesso modo, una centrale può essere un client GATT o un server GATT.

source: A peripheral device advertises by sending out advertising packets at set intervals to inform nearby central devices of its presence.
it_it: Un dispositivo periferico invia pacchetti pubblicitari a intervalli prestabiliti per informare i dispositivi centrali vicini della sua presenza.

source: A small delay is added to give the ESP32 a moment to set up its network.
it_it: Viene aggiunto un piccolo ritardo per dare all'ESP32 il tempo di configurare la rete.

source: A smarter and more efficient method to do HTTP polling is to use something called AJAX.
it_it: Un metodo più intelligente ed efficiente per eseguire il polling HTTP è utilizzare AJAX.

source: A typical characteristic is composed of the following attributes:
it_it: Una caratteristica tipica è composta dai seguenti attributi:

source: A web server is essentially a powerful computer with one main job: storing websites and delivering them to people who request them.
it_it: Un server web è essenzialmente un computer potente con un compito principale: memorizzare siti web e consegnarli a chi li richiede.

source: A web server works in a remarkably similar way-except instead of delivering food, it delivers websites.
it_it: Un server web funziona in modo sorprendentemente simile, solo che invece di consegnare cibo, consegna siti web.

source: ADC Channels ESP32 integrates two 12-bit SAR ADCs and supports measurements on 15 channels (analog-enabled pins).
it_it: Canali ADC L'ESP32 integra due ADC SAR a 12 bit e supporta misurazioni su 15 canali (pin analogici).

source: ADC channels
it_it: Canali ADC

source: ADC channels - 15 channels of 12-bit SAR ADC with selectable ranges of 0-1V, 0-1.4V, 0-2V, or 0-4V
it_it: Canali ADC: 15 canali ADC SAR a 12 bit con intervalli selezionabili di 0-1 V, 0-1,4 V, 0-2 V o 0-4 V

source: AJAX stands for Asynchronous JavaScript and XML, but you don’t need to worry too much about what the letters mean.
it_it: AJAX sta per Asynchronous JavaScript and XML, ma non è necessario preoccuparsi troppo del significato delle lettere.

source: AP mode is super useful when you don’t have an existing Wi-Fi network available, or when you want to create a private network just for your project.
it_it: La modalità AP è molto utile quando non si dispone di una rete Wi-Fi esistente o quando si desidera creare una rete privata dedicata al proprio progetto.

source: About Arduino ESP32
it_it: Informazioni su Arduino ESP32

source: About ESP32 Bluetooth
it_it: Informazioni sul Bluetooth dell'ESP32

source: Access Point (AP) Mode
it_it: Modalità Access Point (AP)

source: Accessing the Web Server
it_it: Accesso al Server Web

source: Accessing the Web Server in AP Mode
it_it: Accesso al server web in modalità AP

source: Accessing the Web Server in STA mode
it_it: Accesso al Server Web in modalità STA

source: According to the datasheet, in active mode, with all features running concurrently, it can draw as much as 80 mA.
it_it: Secondo la scheda tecnica, in modalità attiva, con tutte le funzionalità attive contemporaneamente, può assorbire fino a 80 mA.

source: Add this tag inside the section of your web page.
it_it: Aggiungere questo tag all'interno della sezione della pagina web.

source: Additionally, it has a u.FL connector for an external antenna and a lipo battery connector for creating battery-operated projects.
it_it: Inoltre, ha un connettore u.FL per un'antenna esterna e un connettore per batteria lipo per la creazione di progetti alimentati a batteria.

source: Additionally, the ESP32 is designed to measure voltages while in sleep mode.
it_it: Inoltre, l'ESP32 è progettato per misurare le tensioni in modalità sleep.

source: Additionally, you will receive these messages in the Arduino IDE Serial Monitor for monitoring purposes.
it_it: Inoltre, si riceveranno questi messaggi nel Monitor Seriale dell'IDE Arduino a scopo di monitoraggio.

source: Adjust the command above accordingly.
it_it: Modificare il comando precedente di conseguenza.

source: Advanced Utilities
it_it: Utilità Avanzate

source: Advertising makes the ESP32 discoverable by other BLE devices.
it_it: La pubblicità rende l'ESP32 rilevabile da altri dispositivi BLE.

source: After installing the ESP32 Arduino Core, restart your Arduino IDE and navigate to Tools > Board to ensure you have ESP32 boards available.
it_it: Dopo aver installato l'ESP32 Arduino Core, riavviare l'IDE Arduino e andare su"Tools > Board" per assicurarsi di avere schede ESP32 disponibili.

source: After installing the toolchain into your environment, you will be able to see all the dedicated examples for the ESP32.
it_it: Dopo aver installato la toolchain nel proprio ambiente, si potranno visualizzare tutti gli esempi dedicati per ESP32.

source: After installing, restart your Arduino IDE and navigate to Tools > Board to ensure you have ESP32 boards available.
it_it: Dopo l'installazione, riavviare l'IDE Arduino e si va su "Tools > Board" per avere schede le ESP32 disponibili.

source: After making these changes, go ahead and upload the code.
it_it: Dopo aver apportato queste modifiche, caricare il codice.

source: After that, our BLE device is configured as a server.
it_it: Dopodiché il dispositivo BLE viene configurato come server.

source: After that, the ESP32 attempts to connect to the WiFi network.
it_it: Dopodiché, l'ESP32 tenta di connettersi alla rete WiFi.

source: After that, we include some CSS styling to make everything look nice.
it_it: Dopodiché, includiamo un po' di stile CSS per rendere il tutto più gradevole.

source: After that, we insert the actual counter value right into the HTML.
it_it: Successivamente, inseriamo il valore effettivo del contatore direttamente nel codice HTML.

source: After the ESP32 is connected, we tell our web server what to do when someone visits a specific web address.
it_it: Dopo che l'ESP32 è connesso, diciamo al server web cosa fare quando qualcuno visita un indirizzo web specifico.

source: After the overwhelming success of the ESP8266, Espressif (the semiconductor company that created the ESP8266) has released a perfect supercharged upgrade - the ESP32.
it_it: Dopo il travolgente successo dell'ESP8266, Espressif (l'azienda di semiconduttori che ha creato l'ESP8266) ha rilasciato un perfetto aggiornamento potenziato: l'ESP32.

source: After uploading the code, open the Serial Monitor and set the baud rate to 115200.
it_it: Dopo aver caricato il codice, aprire il Monitor Seriale e impostare la velocità di trasmissione a 115200.

source: After uploading the sketch, open the Serial Monitor and make sure the baud rate is set to 115200.
it_it: Dopo aver caricato lo sketch, aprire il Monitor Seriale e assicurasi che la velocità di trasmissione sia impostata su 115200.

source: After you upload the sketch to the ESP32, open the Serial Monitor and set the baud rate to 115200.
it_it: Dopo aver caricato lo sketch sull'ESP32, aprire il Monitor Seriale e impostare la velocità di trasmissione a 115200.

source: All GPIOs can be configured as interrupts .
it_it: Tutti i GPIO possono essere configurati come interrupt .

source: All GPIOs can be configured as interrupts.
it_it: Tutti i GPIO possono essere configurati come interrupt.

source: Alternatively, if you have a regulated 5V power supply, you can use the VIN pin to power the ESP32 and its peripherals directly.
it_it: In alternativa, se si dispone di un alimentatore stabilizzato a 5 V, è possibile utilizzare il pin VIN per alimentare direttamente l'ESP32 e le sue periferiche.

source: Although the ESP32 has 48 GPIO pins in total, only 25 of them are broken out to pin headers.
it_it: Sebbene l'ESP32 abbia 48 pin GPIO in totale, solo 25 di essi sono suddivisi in connettori pin.

source: Although the ESP32 has 48 GPIO pins in total, only 25 of them are broken out to the pin headers on both sides of the development board.
it_it: Sebbene l'ESP32 abbia un totale di 48 pin GPIO, solo 25 di questi sono suddivisi nei connettori pin su entrambi i lati della scheda di sviluppo.

source: Although the ESP32 has a lot of pins with various functions, some of them may not be suitable for your projects.
it_it: Sebbene l'ESP32 abbia molti pin con varie funzioni, alcuni di essi potrebbero non essere adatti ai progetti.

source: Although this method can take several arguments, the most common form includes three: the HTTP response code, the content type, and the actual content of the webpage.
it_it: Sebbene questo metodo possa accettare diversi argomenti, la forma più comune ne include tre: il codice di risposta HTTP, il tipo di contenuto e il contenuto effettivo della pagina web.

source: An IP address looks like a series of numbers separated by periods, such as 74.125.130.139 .
it_it: Un indirizzo IP è costituito da una serie di numeri separati da punti, come 74.125.130.139 .

source: Analog interfaces:
it_it: Interfacce analogiche:

source: Analog-enabled GPIOs and Capacitive-touch-enabled GPIOs can be configured as digital GPIOs.
it_it: I GPIO analogici e quelli touch capacitivi possono essere configurati come GPIO digitali.

source: Analog-enabled GPIOs and capacitive-touch-enabled GPIOs can be configured as digital GPIOs.
it_it: I GPIO analogici e quelli touch capacitivi possono essere configurati come GPIO digitali.

source: And don’t worry if you don’t have this exact DS18B20 sensor; the same idea can be used to display data from almost any other sensor you might have!
it_it: E non c'è da preoccuparsi se non è esattamente questo sensore DS18B20; la stessa idea può essere utilizzata per visualizzare i dati di quasi tutti gli altri sensori!

source: And finally, they send an updated web page back to your browser using server.send() .
it_it: E infine, inviano una pagina web aggiornata al browser tramite server.send() .

source: And it works not just for LEDs-you can use the same idea to control motors, relays, sensors, or even smart appliances at home, all through a simple web interface!
it_it: E non funziona solo per i LED: si può usare la stessa idea per controllare motori, relé, sensori o persino elettrodomestici intelligenti in casa, il tutto tramite una semplice interfaccia web!

source: And the %CHECK% placeholder determines whether the checkbox should be checked or unchecked (toggle switch is either on or off) when the page loads.
it_it: Il segnaposto %CHECK% determina se la casella di controllo deve essere selezionata o deselezionata (lo switch è acceso o spento) al caricamento della pagina.

source: And this is what we will use for our experiments.
it_it: Ed è ciò che useremo per i nostri esperimenti.

source: And, of course, we still have a rule for server.onNotFound() to show a “Page Not Found” message if someone types in a wrong address.
it_it: E, naturalmente, abbiamo ancora una regola per server.onNotFound() per mostrare un messaggio "Page Not Found" se qualcuno digita un indirizzo errato.

source: And, we should listen to these events.
it_it: E dovremmo ascoltare questi eventi.

source: Arduino Core Reference
it_it: Riferimento Arduino Core

source: Arduino ESP32 core v2.x.x cannot be used on Windows 8.x x86 (32 bits), Windows 7 or earlier.
it_it: Arduino ESP32 core v2.x.x non può essere utilizzato su Windows 8.x x86 (32 bit), Windows 7 o versioni precedenti.

source: Arduino Official Documentation: `Arduino Reference`_.
it_it: Documentazione Ufficiale di Arduino: `Arduino Reference`_.

source: Arduino as an ESP-IDF component
it_it: Arduino come componente ESP-IDF

source: Arduino develops the cores for the microcontrollers (Atmel AVR MCUs) used on their boards, but anyone can develop a core for their own boards as long as they follow the rules and requirements set by Arduino.
it_it: Arduino sviluppa i core per i microcontrollori (MCU Atmel AVR) utilizzati sulle proprie schede, ma chiunque può sviluppare un core per le proprie schede, purché segua le regole e i requisiti stabiliti da Arduino.

source: Arduino-esp32 project is based on ESP-IDF.
it_it: Il progetto Arduino-esp32 è basato su ESP-IDF.

source: As a result, all active clients will immediately update the LED’s status on their webpages.
it_it: Di conseguenza, tutti i client attivi aggiorneranno immediatamente lo stato del LED sulle loro pagine web.

source: As a result, it has become the standard technology for a wide range of applications, including smart lighting, smart homes, beacons, fitness trackers, insulin pumps, hearing aids, and other energy-sensitive applications.
it_it: Di conseguenza, è diventato la tecnologia standard per un'ampia gamma di applicazioni, tra cui illuminazione intelligente, case intelligenti, beacon, fitness tracker, pompe per insulina, apparecchi acustici e altre applicazioni sensibili al consumo energetico.

source: As a result, the server can send data to a specific client or broadcast it to all clients without requiring a request.
it_it: Di conseguenza, il server può inviare dati a un client specifico o trasmetterli a tutti i client senza richiedere una richiesta.

source: As previously mentioned in this tutorial, the D2 pin of the board is connected to the on-board Blue LED and is user programmable.
it_it: Come accennato in precedenza in questo tutorial, il pin D2 della scheda è collegato al LED blu integrato ed è programmabile dall'utente.

source: As soon as you click it, your browser sends a request to the ESP32 using a special web address: /led1on .
it_it: Non appena si clicca, il browser invia una richiesta all'ESP32 utilizzando un indirizzo web speciale: /led1on .

source: As using ESP32 BLE is a little more complicated than using Bluetooth Classic, we’ve covered that in a separate tutorial.
it_it: Poiché utilizzare ESP32 BLE è un po' più complicato rispetto a Bluetooth Classic, parliamo in un tutorial separato.

source: As you can see, the properties of the characteristic, in this case READ and WRITE , are passed as arguments along with the CHARACTERISTIC_UUID .
it_it: Come si vede, le proprietà della caratteristica, in questo caso READ e WRITE , vengono passate come argomenti insieme a CHARACTERISTIC_UUID .

source: As you can see, when the event type is WS_EVT_CONNECT or WS_EVT_DISCONNECT , the Serial monitor displays the IP address and unique ID of the clients as they connect or disconnect.
it_it: Come si vede, quando il tipo di evento è WS_EVT_CONNECT o WS_EVT_DISCONNECT , il monitor seriale visualizza l'indirizzo IP e l'ID univoco dei client durante la connessione o la disconnessione.

source: AsyncTCP.h : the ESPAsyncWebServer library relies on this library.
it_it: AsyncTCP.h : la libreria ESPAsyncWebServer si basa su questa libreria.

source: At the beginning of the HTML, we include <!DOCTYPE html> to tell the browser that this is an HTML5 document.
it_it: All'inizio del codice HTML, includiamo <!DOCTYPE html> per indicare al browser che si tratta di un documento HTML5.
